<?php

namespace Database\Seeders;

// use Illuminate\Database\Console\Seeds\WithoutModelEvents;

use App\Models\AttachedFile;
use App\Models\Place;
use App\Models\Reason;
use App\Models\SoumDistrict;
use App\Models\LegalEntity;
use App\Models\Register;
use App\Models\Resolve;
use App\Models\Status;
use App\Models\Industry;
use Illuminate\Database\Seeder;

class DatabaseSeeder extends Seeder
{
    /**
     * Seed the application's database.
     *
     * @return void
     */
    public function run()
    {


        // \App\Models\User::create();

        ini_set('memory_limit', '-1');


        $this->call([
            AimagSoumDistictSeeder::class,
            BagHorooSeeder::class,
            LegalEntitySeeder::class,
        ]);


        Place::create(['id' => 1, 'name' => "Ашигт малтмалын хайгуул, олборлолт, боловсруулалтаас гарах хаягдал"]);
        Place::create(['id' => 2, 'name' => "Газрын тосны боловсруулалт, байгалийн хий цэвэрлэгээ, нүүрсний пиролизийн боловсруулалтын хаягдал"]);
        Place::create(['id' => 3, 'name' => "Органик биш химийн үйлдвэрийн хаягдал"]);
        Place::create(['id' => 4, 'name' => "Органик химийн үйлдвэрийн хаягдал"]);
        Place::create(['id' => 5, 'name' => "Гадаргуу бүрэгч материал (будаг, лак, паалан), цавуу, чигжээс, хэвлэлийн будаг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал"]);
        Place::create(['id' => 6, 'name' => "Фото зургийн үйлдвэрлэлийн хаягдал"]);
        Place::create(['id' => 7, 'name' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал. "]);
        Place::create(['id' => 8, 'name' => "Өнгөт төмөрлөгийн гидрометаллургийн процессын хаягдал"]);
        Place::create(['id' => 9, 'name' => "Хаягдал тос ба шингэн түлш (хүнсний тос, Д ба Л бүлгийн тос хамаарахгүй)"]);
        Place::create(['id' => 10, 'name' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/ аэрозолийн хаягдал (Ё, Ж ангиллын хаягдал хамаарахгүй)"]);


        Reason::create(['place_id' => 1,    'sub_group' => "Металлын хүдрийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010201*", 'name' =>    "Сульфидийн хүдрийн боловсруулалтын хүчиллэг урсац үүсгэдэг хаягдал чулуулаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металлын хүдрийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010202*", 'name' =>    "Хортой бодис агуулсан бусад хаягдал чулуулаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металлын хүдрийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010204*", 'name' =>    "Хар төмөрлөгийн эрдсийн физик-химийн боловсруулалтын хортой бодис агуулсан бусад төрлийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металл бус эрдсийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010301*", 'name' =>    "Металл бус эрдсийн физик-химийн боловсруулалтын хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металл бус эрдсийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010402*", 'name' =>    "Тос агуулсан өрөмдлөгийн шавар ба хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металл бус эрдсийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "010403*", 'name' =>    "Өрөмдлөгийн хортой бодис агуулсан шавар ба хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металл бус эрдсийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "020107*", 'name' =>    "Хортой бодис агуулсан агрохимийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Металл бус эрдсийн физик-химийн боловсруулалтын хаягдал", 'code' =>    "030102*", 'name' =>    "Хортой бодис агуулсан үртэс, зоргодос, тайрдас, мод, хавтан, хуулганы хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "030201*", 'name' =>    "Галоген агуулаагүй органик бодис агуулсан мод идээлэгч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "030102*", 'name' =>    "Хлор органик бодис агуулсан мод идээлэгч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "030103*", 'name' =>    "Металл органик бодис агуулсан мод идээлэгч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "030104*", 'name' =>    "Органик биш мод идээлэгч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "030105*", 'name' =>    "Хортой бодис агуулсан бусад мод идээлэгч", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040103*", 'name' =>    "Уусгагч агуулсан тосгүйжүүлэлтийн хаягдал (шингэн фазгүй)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040104*", 'name' =>    "Хром агуулсан идээлгийн шингэн", 'stype' => "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040106*", 'name' =>    "Хром агуулсан хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх лаг", 'stype' => "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040203*", 'name' =>    "Органик уусгагч агуулсан эцсийн боловсруулалтын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040205*", 'name' =>    "Хортой бодис агуулсан будаг, пигментийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 1,    'sub_group' => "Мод идээлэх үед үүсэх хаягдал", 'code' =>    "040207*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050101*", 'name' =>    "Давсгүйжүүлэлтээс үүсэх лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050102*", 'name' =>    "Танкны ёроолын лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050103*", 'name' =>    "Хүчиллэг, шүлтлэг лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050104*", 'name' =>    "Асгарсан тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050105*", 'name' =>    "Байгууламж болон тоног төхөөрөмжийн засвар үйлчилгээнээс үүсэх тосорхог лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050106*", 'name' =>    "Хүчиллэг давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050107*", 'name' =>    "Бусад давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050108*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050110*", 'name' =>    "Тосны шүлтийн цэвэрлэгээнээс үүсэх хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050111*", 'name' =>    "Хүчил агуулсан тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Газрын тосны боловсруулалтын хаягдал", 'code' =>    "050114*", 'name' =>    "Шүүлтүүрийн ашигласан шавар", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Нүүрсний пиролизийн боловсруулалтын хаягдал", 'code' =>    "050201*", 'name' =>    "Хүчиллэг давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Нүүрсний пиролизийн боловсруулалтын хаягдал", 'code' =>    "050202*", 'name' =>    "Бусад давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 2,    'sub_group' => "Байгалийн хий цэвэрлэгээ, тээвэрлэлтээс үүсэх хаягдал", 'code' =>    "050301*", 'name' =>    "Мөнгөн ус агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060101*", 'name' =>    "Хүхрийн хүчил ба хүхэрлэг хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060102*", 'name' =>    "Хлорт устөрөгчийн хүчил (давсны хүчил)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060103*", 'name' =>    "Фторт устөрөгчийн хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060104*", 'name' =>    "Фосфорын ба фосфорлог хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060105*", 'name' =>    "Азотын хүчил ба азотлог хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүчил үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060106*", 'name' =>    "Бусад хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Шүлт үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060201*", 'name' =>    "Кальцийн гидроксид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Шүлт үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060202*", 'name' =>    "Аммонийн гидроксид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Шүлт үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060203*", 'name' =>    "Натрийн ба калийн гидроксид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Шүлт үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060204*", 'name' =>    "Бусад шүлт", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Давс болон түүний уусмал, металлын оксид үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060301*", 'name' =>    "Цианид агуулсан давс ба уусмал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Давс болон түүний уусмал, металлын оксид үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060302*", 'name' =>    "Хүнд металл агуулсан давс ба уусмал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Давс болон түүний уусмал, металлын оксид үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060304*", 'name' =>    "Хүнд металл агуулсан металлын оксид", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "06 03-д зааснаас бусад металл агуулсан хаягдал", 'code' =>    "060403*", 'name' =>    "Хүнцэл агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "06 03-д зааснаас бусад металл агуулсан хаягдал", 'code' =>    "060404*", 'name' =>    "Мөнгөн ус агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "06 03-д зааснаас бусад металл агуулсан хаягдал", 'code' =>    "060405*", 'name' =>    "Бусад хүнд металл агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хаягдал шингэний анхан шатны цэвэрлэгээнээс үүсэх лаг", 'code' =>    "060501*", 'name' =>    "Хаягдал шингэний анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Хүхэрт нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал болон хүхэрт нэгдлийн боловсруулалт ба хүхэргүйжүүлэлтээс үүсэх хаягдал", 'code' =>    "060601*", 'name' =>    "Хортой сульфид агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Галоген болон галогент нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060701*", 'name' =>    "Электролизийн процессоос үүсэх асбест агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Галоген болон галогент нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060702*", 'name' =>    "Хлорын үйлдвэрлэлээс үүсэх идэвхжүүлсэн нүүрс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Галоген болон галогент нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060703*", 'name' =>    "Мөнгөн ус агуулсан барийн сульфатын лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Галоген болон галогент нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060704*", 'name' =>    "Хүчил ба уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Цахиур ба цахиурт нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060801*", 'name' =>    "Хортой цахиурын нэгдэл агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Цахиур ба цахиурт нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "060902*", 'name' =>    "Хортой бодис агуулсан болон хортой бодисоор бохирдсон кальци суурьтай урвалын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Азотын нэгдэл үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал, азот оролцсон химийн процесс болон бордооны үйлдвэрлэлээс үүсэх хаягдал", 'code' =>    "061001*", 'name' =>    "Хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Бусад органик биш химийн үйлдвэрлэлийн хаягдал", 'code' =>    "061201*", 'name' =>    "Органик бус ургамал хамгааллын бодис, мод идээлэгч бодис болон бусад биоцид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Бусад органик биш химийн үйлдвэрлэлийн хаягдал", 'code' =>    "061202*", 'name' =>    "Ашигласан идэвхжүүлсэн нүүрс (Е 07 02-д зааснаас бусад)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Бусад органик биш химийн үйлдвэрлэлийн хаягдал", 'code' =>    "061204*", 'name' =>    "Асбестын боловсруулалтын хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 3,    'sub_group' => "Бусад органик биш химийн үйлдвэрлэлийн хаягдал", 'code' =>    "061205*", 'name' =>    "Хөө", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070101*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070102*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070103*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070104*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070105*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070106*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070107*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик бодисыг үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070108*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070201*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070202*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070203*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070204*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070205*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070206*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070207*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070208*", 'name' =>    "Хортой бодис агуулсан хаягдал бохир усны анхан шатны цэвэрлэгээнээс гарсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070211*", 'name' =>    "Хортой бодис агуулсан нэмэлт бодисын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Хуванцар, резин, хиймэл мяндас үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070213*", 'name' =>    "Силиконы хортой нэгдэл агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070301*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070302*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070303*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070304*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070305*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070306*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070307*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Органик будаг, пигмент үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070308*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070401*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070402*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070403*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070404*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070405*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070406*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070407*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070408*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Ургамал хамгааллын органик бодис (02 01 07 ба 02 01 08-аас бусад), мод идээлэгч бодис (0302-аас бусад), бусад биоцид", 'code' =>    "070410*", 'name' =>    "Хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070501*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070502*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070503*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070504*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070505*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070506*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070507*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070508*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Эм үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070510*", 'name' =>    "Хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070601*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070602*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070603*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070604*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070605*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070606*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070607*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Тос, тосон түрхлэг, саван, угаалгын нунтаг, ариутгал халдваргүйтлийн бодис, гоо сайхны бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070608*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070701*", 'name' =>    "Усан угаагч шингэн ба эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070702*", 'name' =>    "Галогент органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070703*", 'name' =>    "Бусад органик уусгагч, угаагч шингэн, эх уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070704*", 'name' =>    "Галогент тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070705*", 'name' =>    "Бусад тунадас, үлдэгдэл", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070706*", 'name' =>    "Галогент шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070707*", 'name' =>    "Бусад шүүгдсэн хатуу хэсэг ба ашигласан абсорбент", 'stype' =>    "А"]);
        Reason::create(['place_id' => 4,    'sub_group' => "Дээд зэргийн цэвэршилтэй химийн бодис, бүтээгдэхүүн үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх үед үүсэх хаягдал", 'code' =>    "070708*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080101*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан будаг, лакны хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080103*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан будаг, лакны лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080105*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан будаг, лакны усархаг шингэн лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080107*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан будаг, лакыг гадаргуугаас хусах, зайлуулах үед үүсэх хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080109*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан будаг, лакны усархаг тунадас", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080111*", 'name' =>    "Будаг, лак арилгагч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080303*", 'name' =>    "Хортой бодис агуулсан хэвлэлийн бэхний хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080305*", 'name' =>    "Хортой бодис агуулсан хэвлэлийн бэхний лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080307*", 'name' =>    "Идүүлэгч уусмалын хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080308*", 'name' =>    "Хортой бодис агуулсан хэвлэлийн хорны хаягдал (картрижийн хамт)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Будаг, лак үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал", 'code' =>    "080310*", 'name' =>    "Шүршигч тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Цавуу, чигжээс үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал (ус нэвчүүлдэггүй бүтээгдэхүүн ороод)", 'code' =>    "080401*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан цавуу, чигжээсний хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Цавуу, чигжээс үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал (ус нэвчүүлдэггүй бүтээгдэхүүн ороод)", 'code' =>    "080403*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан цавуу, чигжээсний лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Цавуу, чигжээс үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал (ус нэвчүүлдэггүй бүтээгдэхүүн ороод)", 'code' =>    "080405*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан цавуу, чигжээсний усархаг лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Цавуу, чигжээс үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал (ус нэвчүүлдэггүй бүтээгдэхүүн ороод)", 'code' =>    "080407*", 'name' =>    "Органик уусгагч болон бусад хортой бодис агуулсан цавуу, чигжээсний усархаг шингэн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Цавуу, чигжээс үйлдвэрлэх, бэлтгэх, тээвэрлэх, хэрэглэх, арилгах үед үүсэх хаягдал (ус нэвчүүлдэггүй бүтээгдэхүүн ороод)", 'code' =>    "080409*", 'name' =>    "Давирхайн тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 5,    'sub_group' => "Ж ангилалд ороогүй бусад хаягдал", 'code' =>    "080501*", 'name' =>    "Изоцианатын хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090101*", 'name' =>    "Усан суурьт дүрс ялгаруулагч болон идэвхжүүлэгч уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090102*", 'name' =>    "Усан суурьт оффсет хэвлэлийн дүрс ялгаруулагч уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090103*", 'name' =>    "Уусгагч суурьт дүрс ялгаруулагч уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090104*", 'name' =>    "Бэхжүүлэгч уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090105*", 'name' =>    "Цайруулагч уусмал ба цайруулаглтыг бэхжүүлэгч уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090106*", 'name' =>    "Фото зургийн хаягдлын анхан шатны цэвэрлэгээнээс үүсэх мөнгө агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090110*", 'name' =>    "16 06 01, 16 06 02, 16 06 03-д заасан батерейтай нэг удаагийн зургийн аппарат", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "090112*", 'name' =>    "Мөнгө ялгах ажиллагаанаас үүсэх шингэн хаягдал (09 01 06-д зааснаас бусад)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100104*", 'name' =>    "Тосны дэгдэмхий үнс, зуухны тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100107*", 'name' =>    "Хүхрийн хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100108*", 'name' =>    "Эмульсжүүлсэн нүүрс-устөрөгчийн түлшнээс үүсэх дэгдэмхий үнс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100109*", 'name' =>    "Хортой бодис агуулсан хаягдал хам-шатаах зуухны доод үнс, шлак, зуухны тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100111*", 'name' =>    "Хортой бодис агуулсан хаягдал хам-шатаах зуухны дэгдэмхий үнс", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100113*", 'name' =>    "Хий цэвэрлэгээнээс үүсэх аюултай бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100115*", 'name' =>    "Шингэн хаягдлын анхан шатны цэвэрлэгээнээс үүсэх хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100117*", 'name' =>    "Зуухны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан усархаг шингэн лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100203*", 'name' =>    "Хий цэвэрлэгээнээс үүсэх аюултай бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100206*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100208*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх аюултай бодис агуулсан лаг, фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100302*", 'name' =>    "Хүдрийн боловсруулалтаас үүсэх шаар", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100304*", 'name' =>    "Хаягдал хөнгөнцагааны боловсруулалтын давс агуулсан шаар", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100305*", 'name' =>    "Хаягдал хөнгөнцагааны хайлуулалтын хар хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100306*", 'name' =>    "Шатамхай эсвэл устай харилцан үйлчлэх үед шатамхай хий үүсгэдэг хайлуулалтаас үүсэх өрөм", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100308*", 'name' =>    "Анодоос үүсэх давирхай агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100310*", 'name' =>    "Утааны хийн хортой бодис агуулсан тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100312*", 'name' =>    "Хортой бодис агуулсан бусад тоосонцор ба тоос (бөмбөлөгт тээрмийн тоос ороод)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100314*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100316*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан лаг, фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100318*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Фото зургийн үйлдвэрлэлийн хаягдал", 'code' =>    "100320*", 'name' =>    "Давс агуулсан шаар болон хайлуулалтын хар хаягдлын боловсруулалтаас үүсэх хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100401*", 'name' =>    "Шаар (анхдагч болон хоёрдогч хайлуулалтын)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100402*", 'name' =>    "Анхдагч болон хоёрдогч хайлуулалтаас үүсэх хаягдал, өрөм", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100403*", 'name' =>    "Кальцын арсенат", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100404*", 'name' =>    "Утааны хийн тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100405*", 'name' =>    "Бусад тоосонцор ба тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100406*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100407*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100408*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100502*", 'name' =>    "Утааны хийн тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100504*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100505*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100506*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100508*", 'name' =>    "Шатамхай эсвэл устай харилцан үйлчлэх үед аюултай хэмжээгээр шатамхай хий үүсгэдэг хайлуулалтаас үүсэх өрөм, хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100603*", 'name' =>    "Утааны хийн тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100605*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100606*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100607*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100706*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100802*", 'name' =>    "Шаар (анхдагч болон хоёрдогч хайлуулалтын)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100804*", 'name' =>    "Шатамхай эсвэл устай харилцан үйлчлэх үед шатамхай хий үүсгэдэг хайлуулалтаас үүсэх өрөм, хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100806*", 'name' =>    "Анодоос үүсэх давирхай агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100809*", 'name' =>    "Хортой бодис агуулсан утааны хийн тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100811*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100813*", 'name' =>    "Хөргөлтийн усны цэвэрлэгээнээс үүсэх тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100902*", 'name' =>    "Хортой бодис агуулсан хайлмаг цутгаагүй хэв, хэвний гол", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100904*", 'name' =>    "Хортой бодис агуулсан хайлмаг цутгасан хэв, хэвний гол", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100906*", 'name' =>    "Хортой бодис агуулсан утааны хийн тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100908*", 'name' =>    "Хортой бодис агуулсан бусад тоосонцор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100910*", 'name' =>    "Хортой бодис агуулсан холбогч", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "100912*", 'name' =>    "Хортой бодис агуулсан ан цав илрүүлэгч бодис", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101002*", 'name' =>    "Хайлмаг цутгаагүй хортой бодис агуулсан хэв, хэвний гол", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101004*", 'name' =>    "Хайлмаг цутгасан хортой бодис агуулсан хэв, хэвний гол", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101006*", 'name' =>    "Хортой бодис агуулсан утааны хийн тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101008*", 'name' =>    "Хортой бодис агуулсан бусад тоосонцор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101010*", 'name' =>    "Хортой бодис агуулсан холбогч", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101012*", 'name' =>    "Хортой бодис агуулсан ан цав илрүүлэгч бодис", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101103*", 'name' =>    "Шилний түүхий эдийн хортой бодис агуулсан хольц бэлтгэх үед үүсэх хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101105*", 'name' =>    "Хүнд металл агуулсан үйрмэг ба нунтаг шилний хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101107*", 'name' =>    "Шил өнгөлөх, зүлгэх үед үүсэх хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101108*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101110*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101112*", 'name' =>    "Хаягдал усны анхан шатны цэвэрлэгээнээс үүсэх аюултай бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101206*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101208*", 'name' =>    "Хүнд металл агуулсан паалангийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101305*", 'name' =>    "Асбест агуулсан асбест-цементийн үйлдвэрийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Хар тугалганы үйлдвэрлэлийн дулааны процессоос үүсэх хаягдал", 'code' =>    "101308*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хортой бодис агуулсан хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 6,    'sub_group' => "Чандарлах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "101401*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх мөнгөн ус агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110101*", 'name' =>    "Гадаргуу цэвэрлэгч хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110102*", 'name' =>    "11 01 01-д зааснаас бусад хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110103*", 'name' =>    "Гадаргуу цэвэрлэгч шүлт", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110104*", 'name' =>    "Фосфатжуулалтын лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110105*", 'name' =>    "Хортой бодис агуулсан лаг ба фильтрт шүүгдсэн хатуу хэсэг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110107*", 'name' =>    "Хортой бодис агуулсан зайлагч усархаг шингэн", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110109*", 'name' =>    "Хортой бодис агуулсан тосгүйжүүлэгчийн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110111*", 'name' =>    "Ион солилцооны эсвэл мембран системийн хортой бодис агуулсан лаг ба ханд", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110112*", 'name' =>    "Ханасан эсвэл ашигласан ион солилцооны давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл болон бусад материалын гадаргуугийн химийн боловсруулалт ба гадаргууг бүрэх үед үүсэх хаягдал", 'code' =>    "110113*", 'name' =>    "Хортой бодис агуулсан бусад хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Өнгөт төмөрлөгийн гидрометаллургийн процессын хаягдал", 'code' =>    "110201*", 'name' =>    "Цайрын гидрометаллургийн процессын лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Өнгөт төмөрлөгийн гидрометаллургийн процессын хаягдал", 'code' =>    "110203*", 'name' =>    "Зэсийн гидрометаллургийн процессын хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Өнгөт төмөрлөгийн гидрометаллургийн процессын хаягдал", 'code' =>    "110206*", 'name' =>    "Хортой бодис агуулсан бусад хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "110301*", 'name' =>    "Цианид агуулсан хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "110302*", 'name' =>    "Бусад хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "110403*", 'name' =>    "Хийн цэвэрлэгээний хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "110404*", 'name' =>    "Ашигласан флюс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120106*", 'name' =>    "Галоген агуулсан эрдсийн тос /эмульс, уусмалаас бусад/", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120107*", 'name' =>    "Галоген агуулаагүй эрдсийн тос /эмульс, уусмалаас бусад/", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120108*", 'name' =>    "Галоген агуулсан эмульс, уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120109*", 'name' =>    "Галоген агуулаагүй эмульс, уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120110*", 'name' =>    "Нийлэг тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120111*", 'name' =>    "Ашигласан лав,тосон түрхлэг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120113*", 'name' =>    "Хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120115*", 'name' =>    "Хортой бодис агуулсан зүлгүүрийн материалын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120117*", 'name' =>    "Тос агуулсан металлын лаг /өнгөлгөө, зүлгүүр, заслын/", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120118*", 'name' =>    "Биозадралд түргэн ордог тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 7,    'sub_group' => "Металл хатжуулах процессын хаягдал", 'code' =>    "120119*", 'name' =>    "Хортой бодис агуулсан өнгөлгөөний материал, зүлгүүр", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130101*", 'name' =>    "Полихлорт бифенил (PCBS) агуулсан гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130102*", 'name' =>    "Хлор агуулсан эмульс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130103*", 'name' =>    "Хлор агуулаагүй эмульс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130104*", 'name' =>    "Хлор агуулсан эрдсийн гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130105*", 'name' =>    "Хлор агуулаагүй эрдсийн гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130106*", 'name' =>    "Нийлэг гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130107*", 'name' =>    "Биозадралд түргэн ордог гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Гидравлик тосны хаягдал", 'code' =>    "130108*", 'name' =>    "Бусад төрлийн гидравлик тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны тосны хаягдал", 'code' =>    "130201*", 'name' =>    "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны хлор агуулсан эрдсийн тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны тосны хаягдал", 'code' =>    "130202*", 'name' =>    "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны хлор агуулаагүй эрдсийн тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны тосны хаягдал", 'code' =>    "130203*", 'name' =>    "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны нийлэг тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны тосны хаягдал", 'code' =>    "130204*", 'name' =>    "Биозадралд түргэн ордог хөдөлгүүр, хурдны хайрцагны болон тосолгооны тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны тосны хаягдал", 'code' =>    "130205*", 'name' =>    "Хөдөлгүүр, хурдны хайрцагны болон тосолгооны бусад тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130301*", 'name' =>    "Полихлорт бифенил (PCBS) агуулсан тусгаарлагч болон дулаан дамжуулагч тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130302*", 'name' =>    "Хлор агуулсан тусгаарлагч болон дулаан дамжуулагч эрдсийн тос (13 03 01-д зааснаас бусад)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130303*", 'name' =>    "Хлор агуулаагүй тусгаарлагч болон дулаан дамжуулагч эрдсийн тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130304*", 'name' =>    "Нийлэг тусгаарлагч болон дулаан дамжуулагч тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130305*", 'name' =>    "Биозадралд түргэн ордог тусгаарлагч болон дулаан дамжуулагч тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгаарлагч, дулаан дамжуулах тосны хаягдал", 'code' =>    "130306*", 'name' =>    "Бусад төрлийн тусгаарлагч болон дулаан дамжуулагч тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130401*", 'name' =>    "Элсэн шүүлтүүр болон тос, ус ялгагчаас гарсан хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130402*", 'name' =>    "Тос, ус ялгагчаас гарсан лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130403*", 'name' =>    "Тос баригчаас үүсэх лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130404*", 'name' =>    "Тос, ус ялгагчаас үүсэх тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130405*", 'name' =>    "Тос, ус ялгагчаас үүсэх тосорхог ус", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Ус, тос ялгах үйл ажиллагаанаас үүсэх хаягдал", 'code' =>    "130406*", 'name' =>    "Элсэн шүүгч болон тос, ус ялгагчаас гарсан холимог хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Шингэн түлшний хаягдал", 'code' =>    "130501*", 'name' =>    "Түлшний тос, дизель", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Шингэн түлшний хаягдал", 'code' =>    "130502*", 'name' =>    "Бензин", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Шингэн түлшний хаягдал", 'code' =>    "130503*", 'name' =>    "Бусад түлш (холимог түлш орно)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгайлан заагдаагүй бусад тосны хаягдал", 'code' =>    "130601*", 'name' =>    "Давсгүйжүүлэх процессийн лаг болон эмульс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгайлан заагдаагүй бусад тосны хаягдал", 'code' =>    "130602*", 'name' =>    "Бусад эмульс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 8,    'sub_group' => "Тусгайлан заагдаагүй бусад тосны хаягдал", 'code' =>    "130699*", 'name' =>    "Тусгайлан заагдаагүй бусад хог хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "140101*", 'name' =>    "Хлорфторт нүүрстөрөгч, HCFC, HFC", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "140102*", 'name' =>    "Бусад галоген агуулсан уусгагч болон уусгагчийн холимог", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "140103*", 'name' =>    "Бусад уусгагч болон уусгагчийн холимог", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "140104*", 'name' =>    "Галогент уусгагч агуулсан лаг болон хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "140105*", 'name' =>    "Бусад төрлийн уусгагч агуулсан лаг болон хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "150109*", 'name' =>    "Хортой бодисын үлдэгдэл агуулсан эсвэл бохирдсон сав баглаа боодол", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Органик уусгагч, хөргүүрийн шингэн болон хөөс/аэрозолийн хаягдал", 'code' =>    "150110*", 'name' =>    "Хортой сүвэрхэг материал бүхий (асбест гэх мэт) металл сав баглаа боодол, даралтат хоосон сав", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "150201*", 'name' =>    "Хортой бодисоор бохирдсон шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160102*", 'name' =>    "Ашиглалтаас гарсан автомашин", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160104*", 'name' =>    "Тосны шүүр", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160105*", 'name' =>    "Мөнгөн ус агуулсан эд анги", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160106*", 'name' =>    "Полихлорт бифенил (PCBS) агуулсан эд анги", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160107*", 'name' =>    "Тэсрэмтгий эд анги (хамгаалалтын дэр г.м)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160108*", 'name' =>    "Асбест бүхий тоормосны жийргэвч (накладка)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160110*", 'name' =>    "Тоормосны шингэн", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160111*", 'name' =>    "Аюултай нэгдэл агуулсан антифризийн шингэн", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Шингээгч, бохир алчуур материал, фильтрийн материал, тусгайлан заагдаагүй хамгаалалтын хувцас", 'code' =>    "160118*", 'name' =>    "16 01 04 -16 01 08 болон 16 01 10, 16 01 11-д заагдсанаас бусад аюултай эд анги", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160201*", 'name' =>    "Полихлорт бифенил (PCBS) агуулсан трансформатор, конденсатор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160202*", 'name' =>    "16 02 01-д дурьдснаас бусад Полихлорт бифенил (PCBS) агуулсан буюу бохирдсон хаягдал тоног төхөөрөмж", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160203*", 'name' =>    "Хлор фторт нүүрстөрөгчид, HCFC, HFC агуулсан хаягдал тоног төхөөрөмж", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160204*", 'name' =>    "Чөлөөт асбест агуулсан хаягдал тоног төхөөрөмж", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160205*", 'name' =>    "16 01 01 - 16 01 04 -д зааснаас бусад хортой бодис агуулсан хаягдал тоног төхөөрөмж", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цахилгаан болон цахим тоног төхөөрөмжийн хаягдал", 'code' =>    "160207*", 'name' =>    "Хаягдал тоног төхөөрөмжөөс ялгаж авсан хортой бодис", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Гологдол болон ашиглагдаагүй бүтээгдэхүүн (хүнсний бүтээгдэхүүн хамаарна)", 'code' =>    "160301*", 'name' =>    "Хортой бодис агуулсан органик биш хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Гологдол болон ашиглагдаагүй бүтээгдэхүүн (хүнсний бүтээгдэхүүн хамаарна)", 'code' =>    "160303*", 'name' =>    "Хортой бодис агуулсан органик хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тэсрэмтгий хаягдал", 'code' =>    "160401*", 'name' =>    "Хаягдал сум", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тэсрэмтгий хаягдал", 'code' =>    "160402*", 'name' =>    "Пиротехникийн бүтээгдэхүүний хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тэсрэмтгий хаягдал", 'code' =>    "160403*", 'name' =>    "Бусад төрлийн тэсрэмтгий хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Химийн бодисын хаягдал, даралттай саванд савласан хий", 'code' =>    "160501*", 'name' =>    "Хортой бодис агуулсан даралттай саванд савласан хий (галонууд хамаарна)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Химийн бодисын хаягдал, даралттай саванд савласан хий", 'code' =>    "160503*", 'name' =>    "Лабораторийн хортой бодис болон түүнийг агуулсан химийн бодис, хольц", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Химийн бодисын хаягдал, даралттай саванд савласан хий", 'code' =>    "160504*", 'name' =>    "Ашиглах боломжгүй органик биш хортой бодис болон түүнийг агуулсан химийн бодис", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Химийн бодисын хаягдал, даралттай саванд савласан хий", 'code' =>    "160505*", 'name' =>    "Ашиглах боломжгүй органик хортой бодис болон түүнийг агуулсан химийн бодис", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Батерей, аккумлятор", 'code' =>    "160601*", 'name' =>    "Хартугалгатай батерей, аккумлятор", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Батерей, аккумлятор", 'code' =>    "160602*", 'name' =>    "Никель - Кадмийн батерей", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Батерей, аккумлятор", 'code' =>    "160603*", 'name' =>    "Мөнгөн ус агуулсан батерей", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Батерей, аккумлятор", 'code' =>    "160606*", 'name' =>    "Батерей, аккумлятороос ялгаж авсан электролитийн уусмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160701*", 'name' =>    "Тос агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160702*", 'name' =>    "Бусад төрлийн хортой бодис агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160802*", 'name' =>    "Аюултай шилжилтийн металл агуулсан ашигласан катализатор болон тэдгээрийн хортой нэгдэл агуулсан ажилласан катализатор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160805*", 'name' =>    "Фосфорын хүчил агуулсан хаягдал катализатор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160806*", 'name' =>    "Хаягдал шингэн катализатор", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Зөөврийн танк, шингэн хадгалах танк, торхны цэвэрлэгээний хаягдал (Д ба М бүлгийн хаягдал хамаарахгүй)", 'code' =>    "160807*", 'name' =>    "Хортой бодис агуулсан хаягдал катализатор", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Исэлдүүлэгч бодисын хаягдал", 'code' =>    "160901*", 'name' =>    "Перманганатууд (калийн перманганат г.м)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Исэлдүүлэгч бодисын хаягдал", 'code' =>    "160902*", 'name' =>    "Хроматууд (калийн хромат, калийн бихромат, натрийн бихромат г.м)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Исэлдүүлэгч бодисын хаягдал", 'code' =>    "160903*", 'name' =>    "Хэт ислүүд (устөрөгчийн хэт исэл г.м)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Исэлдүүлэгч бодисын хаягдал", 'code' =>    "160904*", 'name' =>    "Тусгайлан заагдаагүй бусад исэлдүүлэгчид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цэвэрлэх байгууламжийн усархаг шингэн хаягдал", 'code' =>    "161001*", 'name' =>    "Хортой бодис агуулсан усархаг хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Цэвэрлэх байгууламжийн усархаг шингэн хаягдал", 'code' =>    "161003*", 'name' =>    "Хортой бодис агуулсан өтгөн усархаг хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "161101*", 'name' =>    "Металлургийн процессын хортой бодис агуулсан нүүрстөрөгч суурьт галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "161103*", 'name' =>    "Металлургийн процессын хортой бодис агуулсан бусад галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "161105*", 'name' =>    "Металлургийн бус процессын хортой бодис агуулсан галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "161202*", 'name' =>    "Халдварт өвчин, хордлогын улмаас үхсэн болон зориудаар устгасан мал, амьтны хүүр, сэг зэм", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "170104*", 'name' =>    "Хортой бодис агуулсан бетон, тоосго, өнгөлгөөний хавтан, керамикийн холимог хаягдал болон ангилж ялгасан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Галд тэсвэртэй материал болон доторлогооны материалын хаягдал", 'code' =>    "170204*", 'name' =>    "Хортой бодисоор бохирдсон мод, шил, хуванцар", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Битумений холимог, нүүрсний давирхай болон давирхайжсан бүтээгдэхүүнүүд", 'code' =>    "170301*", 'name' =>    "Нүүрсний давирхай агуулсан битумийн холимог", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Битумений холимог, нүүрсний давирхай болон давирхайжсан бүтээгдэхүүнүүд", 'code' =>    "170303*", 'name' =>    "Нүүрсний давирхай болон бусад давирхайжсан бүтээгдэхүүн", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Битумений холимог, нүүрсний давирхай болон давирхайжсан бүтээгдэхүүнүүд", 'code' =>    "170408*", 'name' =>    "Хортой бодисоор бохирдсон металл", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Битумений холимог, нүүрсний давирхай болон давирхайжсан бүтээгдэхүүнүүд", 'code' =>    "170409*", 'name' =>    "Тос, давирхай болон бусад төрлийн хортой бодис агуулсан кабель", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хөрс (бохирдсон газраас ухаж гаргасан хөрс орно), чулуу, хурдас", 'code' =>    "170501*", 'name' =>    "Хортой бодис агуулсан хөрс, чулуу", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хөрс (бохирдсон газраас ухаж гаргасан хөрс орно), чулуу, хурдас", 'code' =>    "170503*", 'name' =>    "Хортой бодис агуулсан хурдас", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хөрс (бохирдсон газраас ухаж гаргасан хөрс орно), чулуу, хурдас", 'code' =>    "170505*", 'name' =>    "Замын хортой бодис агуулсан хайрга, шороо", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Дулаалгын материал, асбест агуулсан барилгын материал", 'code' =>    "170601*", 'name' =>    "Асбест бүхий дулаалгын материал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Дулаалгын материал, асбест агуулсан барилгын материал", 'code' =>    "170602*", 'name' =>    "Хортой бодис болон түүнийг агуулсан бусад дулаалгын материал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Дулаалгын материал, асбест агуулсан барилгын материал", 'code' =>    "170604*", 'name' =>    "Асбест агуулсан барилгын материал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Гипс суурьт барилгын материал", 'code' =>    "170701*", 'name' =>    "Хортой бодисоор бохирдсон гипс суурьт барилгын материал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "170801*", 'name' =>    "Мөнгөн ус агуулсан барилгын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "170802*", 'name' =>    "Полихлорт бифенил (PCBS) агуулсан барилгын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "170803*", 'name' =>    "Барилгын хортой бодис агуулсан бусад хаягдал (холимог хаягдал орно)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180102*", 'name' =>    "Эмгэг хог хаягдал (хүний биеийн эд эрхтэн, хэсэг болон цус, цусан бүтээгдэхүүн, нөөцөлсөн цус (18 01 03-д зааснаас бусад)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180103*", 'name' =>    "Цуглуулах, устгахад тусгай шаардлага тавигддаг халдвартай хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180105*", 'name' =>    "Хортой бодис агуулсан химийн бодисын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180107*", 'name' =>    "Эсэд хортой нөлөөтэй хог хаягдал (Цитотоксик, цитостатик эм гэх мэт)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180109*", 'name' =>    "Шүдний эмнэлгийн амальгам хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180110*", 'name' =>    "Халдвартай шингэн хаягдлын анхан шатны цэвэрлэгээнээс үүсэх лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180202*", 'name' =>    "Цуглуулах, устгахад тусгай шаардлага тавигддаг халдвартай хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180204*", 'name' =>    "Хортой бодис агуулсан химийн бодисын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "180206*", 'name' =>    "Эсэд хортой нөлөөтэй хог хаягдал (Цитотоксик, цитостатик эм гэх мэт)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190102*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх фильтрийн тоос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190103*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх шингэн хаягдал болон бусад шингэн хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190104*", 'name' =>    "Хийн цэвэрлэгээнээс үүсэх хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190105*", 'name' =>    "Хийн цэвэрлэгээнд ашигласан идэвхжүүлсэн нүүрс", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190106*", 'name' =>    "Хортой бодис агуулсан зуухны доод үнс ба шаар", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190108*", 'name' =>    "Хортой бодис агуулсан дэгдэмхий үнс", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190110*", 'name' =>    "Хортой бодис агуулсан зуухны тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190112*", 'name' =>    "Хортой бодис агуулсан пиролизын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190202*", 'name' =>    "Нэг болон түүнээс дээш төрлийн аюултай хаягдал хольсон хог хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190203*", 'name' =>    "Физик-химийн боловсруулалтаас гарсан хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190205*", 'name' =>    "Ялгах процессоос гарсан тос болон баяжмал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190206*", 'name' =>    "Хортой бодис агуулсан шатамхай шингэн хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190207*", 'name' =>    "Хортой бодис агуулсан шатамхай хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Барилгын бусад хаягдал", 'code' =>    "190209*", 'name' =>    "Хортой бодис агуулсан бусад хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тогтворжуулсан/ хатууруулсан хаягдал", 'code' =>    "190301*", 'name' =>    "Хагас тогтворжуулсан, аюултай хог хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тогтворжуулсан/ хатууруулсан хаягдал", 'code' =>    "190303*", 'name' =>    "Хатууруулсан аюултай хог хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тогтворжуулсан/ хатууруулсан хаягдал", 'code' =>    "190402*", 'name' =>    "Дэгдэмхий үнс, хаягдал хийн цэвэрлэгээнээс үүсэх хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Тогтворжуулсан/ хатууруулсан хаягдал", 'code' =>    "190403*", 'name' =>    "Шил хэлбэрт ороогүй хатуу хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190701*", 'name' =>    "Хортой бодис агуулсан ландфиллын шүүрлийн урсац", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190804*", 'name' =>    "Ханасан буюу ашигласан ион солилцооны материал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190805*", 'name' =>    "Ион солилцооны материалыг цэнэглэхэд үүссэн уусмал болон лаг", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190806*", 'name' =>    "Мембран системийн хүнд металл агуулсан хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190808*", 'name' =>    "19 08 07-д зааснаас бусад тос/усыг салгах процессоос гарсан өөх тосны хольц", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190809*", 'name' =>    "Үйлдвэрийн хаягдал усны биологийн цэвэрлэгээнээс үүссэн хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "190811*", 'name' =>    "Үйлдвэрийн хаягдал усны бусад цэвэрлэгээнээс үүссэн хортой бодис агуулсан лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "191003*", 'name' =>    "Хортой бодис агуулсан хөнгөн фракцын хаягдал, тоос", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Ландфиллын шүүрлийн урсац", 'code' =>    "191005*", 'name' =>    "Хортой бодис агуулсан бусад фракцын хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191101*", 'name' =>    "Шүүлтүүрт ашигласан шавар", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191102*", 'name' =>    "Хүчиллэг давирхай", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191103*", 'name' =>    "Усархаг шингэн хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191104*", 'name' =>    "Түлшний шүлтийн цэвэрлэгээнээс үүсэх хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191105*", 'name' =>    "Хортой бодис агуулсан хаягдал усны анхан шатны цэвэрлэгээнээс үүссэн лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191107*", 'name' =>    "Хаягдал хийн цэвэрлэгээнээс үүсэх хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191206*", 'name' =>    "Хортой бодис агуулсан мод", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Хаягдал тос сэргээх процессоос үүсэх хаягдал", 'code' =>    "191211*", 'name' =>    "Хортой бодис агуулсан хаягдлын механик боловсруулалтаас үүсэх бусад хаягдал (холимог хаягдал хамаарна)", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "191301*", 'name' =>    "Хортой бодисоор бохирдсон хөрсний цэвэрлэгээнээс үүсэх хатуу хаягдал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "191303*", 'name' =>    "Хортой бодис агуулсан хөрсний цэвэрлэгээнээс үүсэх лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "191305*", 'name' =>    "Хортой бодис агуулсан газрын доорх усны цэвэрлэгээнээс үүсэх лаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "191307*", 'name' =>    "Хортой бодис агуулсан газрын доорх усны цэвэрлэгээнээс үүсэх усархаг шингэн хаягдал болон өтгөрүүлсэн усан уусмал", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200106*", 'name' =>    "Уусгагч", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200107*", 'name' =>    "Хүчил", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200108*", 'name' =>    "Шүлт", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200109*", 'name' =>    "Фотохимийн бодис", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200110*", 'name' =>    "Пестицид", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200111*", 'name' =>    "Өдрийн гэрэл болон бусад мөнгөн ус агуулсан хаягдал", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200112*", 'name' =>    "Хлорфторт нүүрстөрөгчид агуулсан хаягдал тоног төхөөрөмж, хэрэгсэл", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200114*", 'name' =>    "20 01 13-д зааснаас бусад төрлийн өөх тос", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200115*", 'name' =>    "Хортой бодис агуулсан будаг, бэх, цавуу, резин", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200117*", 'name' =>    "Хортой бодис агуулсан угаалгын бодис, нунтаг", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200119*", 'name' =>    "Эсэд хортой нөлөөтэй хог хаягдал (цитотоксик, цитостатик эм гэх мэт)", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200121*", 'name' =>    "16 06 01, 16 06 02, 16 06 03-д заасан батерей, аккумлятор болон ангилж ялгаагүй эдгээр батерей, аккумляторын холимог", 'stype' =>    "А"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200123*", 'name' =>    "20 01 11, 20 01 12-д зааснаас бусад төрлийн хортой бодис агуулсан хаягдал цахилгаан болон цахим төхөөрөмж, хэрэгсэл", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200125*", 'name' =>    "Хортой бодис агуулсан мод, модон эдлэл", 'stype' =>    "Х"]);
        Reason::create(['place_id' => 9,    'sub_group' => "Бохирдсон хөрс, газрын доорх усны цэвэрлэгээнээс үүсэх хаягдал", 'code' =>    "200129*", 'name' =>    "Зуухны доод үнс, яндангийн хөө", 'stype' =>    "Х"]);

        Industry::create(['name' => 'Үйлдвэрлэл']);
        Industry::create(['name' => 'Барилга']);
        Industry::create(['name' => 'Бөөний болон жижиглэн худалдаа, машин, мотоциклийн засвар үйлчилгээ']);
        Industry::create(['name' => 'Тээвэр, агуулахын үйлчилгээ']);
        Industry::create(['name' => 'Мэргэжлийн, шинжлэх ухаан болон техникийн үйл ажиллагаа']);
        Industry::create(['name' => 'Удирдлагын болон дэмжлэг үзүүлэх үйл ажиллагаа']);


        Status::create(['name' => 'Хадгалсан /Илгээгээгүй/']);
        Status::create(['name' => 'Илгээсэн']);
        Status::create(['name' => 'Шийдвэрлэсэн']);

        Resolve::create(['name' => 'Зөрчлийг арилгуулсан']);
        Resolve::create(['name' => 'Торгууль']);
        Resolve::create(['name' => 'Татгалзсан']);
        Resolve::create(['name' => 'Сануулга']);
        Resolve::create(['name' => 'Мэдэгдэх хуудас']);
        Resolve::create(['name' => 'Албан даалгавар']);
        Resolve::create(['name' => 'Бусад']);


        \App\Models\User::factory()->create([
            'username' => 'admin',
            'name' => 'Админ',
            'phone' => '9999-9999',
            'roles' => 'admin',
            'position' => \App\Models\User::$rolesModel['admin'],
        ]);

        \App\Models\User::factory()->create([
            'username' => 'da',
            'name' => 'name Aimag duurgiin admin',
            'phone' => '8888-8888',
            'roles' => 'da',
            'position' => \App\Models\User::$rolesModel['da'],
        ]);

        \App\Models\User::factory()->create([
            'username' => 'mha',
            'name' => 'name Байгаль орчны хяналтын улсын ахлах байцаагч',
            'phone' => '8888-8888',
            'roles' => 'mha',
            'position' => \App\Models\User::$rolesModel['mha'],
        ]);

        Register::factory(100)->create();
        AttachedFile::factory(150)->create();
    }
}
